Autodesk.Revit.DB.ScheduleFilter.SetValue(Autodesk.Revit.DB.ElementId)
Set the filter value to an ElementId.
id:
The filter value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.SetValue(System.String)
Set the filter value to a string.
string:
The filter value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.FieldId
The ID of the field used to filter the schedule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.#ctor(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFilterType,Autodesk.Revit.DB.ElementId)
Creates a new ScheduleFilter.
fieldId:
The ID of the field used to filter the schedule.
filterType:
The filter type.
value:
The filter value for a filter using an ElementId value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.#ctor(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFilterType,System.String)
Creates a new ScheduleFilter.
fieldId:
The ID of the field used to filter the schedule.
filterType:
The filter type.
value:
The filter value for a filter using a string value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.#ctor(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFilterType,System.Double)
Creates a new ScheduleFilter.
fieldId:
The ID of the field used to filter the schedule.
filterType:
The filter type.
value:
The filter value for a filter using a double value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.#ctor(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFilterType,System.Int32)
Creates a new ScheduleFilter.
fieldId:
The ID of the field used to filter the schedule.
filterType:
The filter type.
value:
The filter value for a filter using an integer value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.#ctor(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFilterType)
Creates a new ScheduleFilter.
fieldId:
The ID of the field used to filter the schedule.
filterType:
The filter type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013